## One Hot Encoding

In [280]:
import pandas as pd 
import numpy as np

In [281]:
df=pd.read_csv('cars.csv')

In [282]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [283]:
df.sample(5)

        brand  km_driven    fuel         owner  selling_price
7159  Renault      60000  Petrol   First Owner         295000
7033  Hyundai       3000  Petrol   First Owner         550000
5116  Hyundai      25000  Petrol   First Owner         412000
6294  Hyundai      56000  Petrol  Second Owner         195000
2361  Renault      10000  Petrol   First Owner         300000

In [284]:
df['owner'].head()

0     First Owner
1    Second Owner
2     Third Owner
3     First Owner
4     First Owner
Name: owner, dtype: object

In [285]:
df['owner'].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

In [286]:
df['fuel'].head()

0    Diesel
1    Diesel
2    Petrol
3    Diesel
4    Petrol
Name: fuel, dtype: object

In [287]:
df.shape

(8128, 5)

In [288]:
df1=pd.get_dummies(df,columns=['fuel','owner'],dtype=int)

In [289]:
df1.head()

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0

In [290]:
df1.shape

(8128, 12)

## one hot encoding using the sklearn

In [291]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df.iloc[:, :4],df.iloc[:,-1],test_size=0.2)

In [292]:
X_train.head()

          brand  km_driven    fuel         owner
2668     Toyota      68089  Petrol   First Owner
842        Tata     100000  Diesel  Second Owner
7943    Hyundai      26263  Petrol   First Owner
7642  Chevrolet      70000     LPG   First Owner
7564    Hyundai      42000  Petrol   First Owner

In [293]:
X_train.shape

(6502, 4)

In [294]:
from sklearn.preprocessing import OneHotEncoder

In [295]:
ohe=OneHotEncoder(drop='first', dtype='int32')

In [296]:
X_train_new=ohe.fit_transform(X_train[['fuel','owner']]).toarray()

In [297]:
X_test_new=ohe.transform(X_test[['fuel','owner']]).toarray()

In [298]:
X_train_new

array([[0, 0, 1, ..., 0, 0, 0],
       [1, 0, 0, ..., 1, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       ...,
       [1, 0, 0, ..., 0, 0, 0],
       [0, 0, 1, ..., 1, 0, 0],
       [0, 0, 1, ..., 0, 0, 0]])

In [299]:
X_test_new

array([[0, 0, 1, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       [0, 0, 1, ..., 1, 0, 0],
       ...,
       [1, 0, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 1, 0, 0],
       [1, 0, 0, ..., 0, 0, 0]])

In [300]:
X_train_new.shape

(6502, 7)

In [301]:
np.hstack((X_train[['brand','km_driven']].values, X_train_new))

array([['Toyota', 68089, 0, ..., 0, 0, 0],
       ['Tata', 100000, 1, ..., 1, 0, 0],
       ['Hyundai', 26263, 0, ..., 0, 0, 0],
       ...,
       ['Maruti', 120000, 1, ..., 0, 0, 0],
       ['Ford', 90000, 0, ..., 1, 0, 0],
       ['Maruti', 10000, 0, ..., 0, 0, 0]], dtype=object)

## One Hot Encoding with the Top categories

In [302]:
df['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [303]:
counts=df['brand'].value_counts()
df['brand'].nunique()

32

In [307]:
threshold=100
repl= counts[counts<=threshold].index

In [309]:
pd.get_dummies(df['brand'].replace(repl,'uncommon'),dtype=int)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,uncommon
0,0,0,0,0,0,0,1,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,1,0,0,0,0
2,0,0,0,1,0,0,0,0,0,0,0,0,0
3,0,0,0,0,1,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,1,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8123,0,0,0,0,1,0,0,0,0,0,0,0,0
8124,0,0,0,0,1,0,0,0,0,0,0,0,0
8125,0,0,0,0,0,0,1,0,0,0,0,0,0
8126,0,0,0,0,0,0,0,0,0,1,0,0,0
8127,0,0,0,0,0,0,0,0,0,1,0,0,0